app/controllers/sessions_controller.rb

  def create
    user = User.authenticate(params[:email], params[:password])

    if user.present?
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "agent111"]]